app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `username` = 'capacity'
AND `password` = 'capacity'
 LIMIT 1
---
    public function login($username, $password)
    {
        $user = $this->where(['username' => $username, 'password' => $password])->first();